1s/ERP/Conf/AccumulationRegisters/Лико_ПаллетыВСекциях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПаллетыВСекциях</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СкладскиеСекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ПараметрыПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ПараметрыПаллет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыПаллет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПаллетыВСекциях/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ОстаткиПоАдресамСекции(Секция) Экспорт 
		
	Соответствие = Новый Соответствие;
		
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПаллетыВСекцияхОстатки.Секция КАК Секция,
	|	Лико_ПаллетыВСекцияхОстатки.Паллет КАК Паллет,
	|	Лико_ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|	Лико_ПаллетыВСекцияхОстатки.КоличествоОстаток КАК Количество,
	|	Лико_ПаллетыВСекцияхОстатки.ЗаблокированОстаток КАК Заблокирован,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер КАК Типоразмер,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Высота КАК Высота,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Глубина КАК Глубина,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Вес КАК Вес,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Ширина КАК Ширина
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(, Секция = &Секция) КАК Лико_ПаллетыВСекцияхОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПаллет.СрезПоследних КАК Лико_ПараметрыПаллетСрезПоследних
	|		ПО Лико_ПаллетыВСекцияхОстатки.Паллет = Лико_ПараметрыПаллетСрезПоследних.Паллет";
	Запрос.УстановитьПараметр("Секция",Секция );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

		
	Пока Выборка.Следующий() Цикл 
		
				
		Структура = Новый Структура;
		Структура.Вставить("Секция");
		Структура.Вставить("Паллет");
		Структура.Вставить("Количество");
		Структура.Вставить("Заблокирован");
		Структура.Вставить("Типоразмер");
		Структура.Вставить("Высота");
		Структура.Вставить("Ширина");
		Структура.Вставить("Глубина");
		Структура.Вставить("Вес");
		
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		
		Соответствие.Вставить(Выборка.Адрес,Структура);

		
	КонецЦикла; 
	
	
	 Возврат Соответствие;
	
		
КонецФункции  

Функция ПолучитьАдрес(Паллет) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|	Лико_ПаллетыВСекцияхОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(, Паллет = &Паллет) КАК Лико_ПаллетыВСекцияхОстатки";
	Запрос.УстановитьПараметр("Паллет",Паллет);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.Адрес;
	
	КонецЦикла; 
	
	
	
	
	
	Возврат Результат;
	
	
КонецФункции  

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
